In [1]:
import pandas as pd
import numpy as np

# 读取CSV文件
df = pd.read_csv('e:/Work/UWB/Code/UwbCOMCode/Plot/XM_UwbCOM_Test_Log_2025-04-07-15-39-18.csv')

# 根据Height分组
df_08 = df[df['Height'] == 0.8].copy()
df_15 = df[df['Height'] == 1.5].copy()

# 确保列名复制
df_08.columns = df.columns
df_15.columns = df.columns

In [2]:
df_08.head(5)

   Point  Height  M_Avg  M_Std  M_Res  M_RSSI  S_Avg  S_Std  S_Res  S_RSSI
0      0     0.8   36.9    1.6   28.1    61.5   38.1    3.8   26.9      71
1      1     0.8   36.5    1.5   14.5    62.0   37.0    1.7   14.0      71
2      2     0.8   36.7    1.6  -22.7    62.0   37.2    1.9  -23.2      71
3      3     0.8   36.6    1.6   15.4    62.5   37.2    1.9   14.8      71
4      4     0.8   36.6    1.6   64.4    62.5   37.1    2.0   63.9      71

In [3]:
df_15.head(5)

    Point  Height  M_Avg  M_Std  M_Res  M_RSSI  S_Avg  S_Std  S_Res  S_RSSI
15      0     1.5   35.1    2.9   52.9    67.5   39.8    5.3   48.2      71
16      1     1.5   35.1    2.9   42.9    67.5   39.8    5.3   38.2      71
17      3     1.5   35.1    2.9   42.9    67.5   39.8    5.3   38.2      71

In [5]:
df_15[df_15['Point'] == 1]

    Point  Height  M_Avg  M_Std  M_Res  M_RSSI  S_Avg  S_Std  S_Res  S_RSSI
16      1     1.5   35.1    2.9   42.9    67.5   39.8    5.3   38.2      71

In [6]:
df_15['Point'] == 1

15    False
16     True
17    False
Name: Point, dtype: bool

In [3]:
str_data = "0000FF66 0106FFFF FFFFFF05 FFFFFFFF FF9DC200 061E006F 1A840E32 5041592E 5359532E 44444630 31A5089F 08023130 89010290 003A006F 368408A0 00000632 010105A5 269F0802 00309F0C 1E022158 40FFFFFF FF020103 10487049 41202646 97202310 31205310 31000000 00000090 00200002 215840FF FFFFFF02 01031048 70494120 26469720 23103120 53103100 0090003E 00000001 56580058 40000101 00000000 00000000 00000000 00000000 00000000 00000000 00000000 00000000 00000000 00000000 00000000 00000000 00900082 0027017D 01010000 00000000 00000002 39303930 11343930 FFFFFFFF 11343930 FFFFFFFF 01343930 00000218 01343930 00000000 01343930 02180701 01343930 00000000 20250612 18522420 25061218 54140000 00000202 00000000 00002ED9 00000000 00000000 00000000 00000000 00000000 00000000 00000000 0000"

In [4]:
result = str_data.replace(" ", "")
print(result)

0000FF660106FFFFFFFFFF05FFFFFFFFFF9DC200061E006F1A840E325041592E5359532E4444463031A5089F0802313089010290003A006F368408A000000632010105A5269F080200309F0C1E02215840FFFFFFFF02010310487049412026469720231031205310310000000000009000200002215840FFFFFFFF0201031048704941202646972023103120531031000090003E000000015658005840000101000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000009000820027017D0101000000000000000000023930393011343930FFFFFFFF11343930FFFFFFFF013439300000021801343930000000000134393002180701013439300000000020250612185224202506121854140000000002020000000000002ED9000000000000000000000000000000000000000000000000000000000000